<?php

namespace Database\Seeders;

use App\Models\User;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;
use Spatie\Permission\Models\Role;

class PermissionsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        // Preparing the array of permissions
        $permissions = [
            ['name' => 'لیست مقادیر اولیه', 'guard_name' => 'web'],
            ['name' => 'لیست تجهیزات سخت افزاری', 'guard_name' => 'web'],
            ['name' => 'لیست تجهیزات پشتیبانی', 'guard_name' => 'web'],
            ['name' => 'لیست تجهیزات دیجیتال', 'guard_name' => 'web'],
            ['name' => 'لیست تجهیزات شبکه', 'guard_name' => 'web'],

            ['name' => 'لیست نقش', 'guard_name' => 'web'],
            ['name' => 'ایجاد نقش', 'guard_name' => 'web'],
            ['name' => 'ویرایش نقش', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات نقش', 'guard_name' => 'web'],
            ['name' => 'حذف نقش', 'guard_name' => 'web'],

            ['name' => 'لیست دسترسی', 'guard_name' => 'web'],
            ['name' => 'ایجاد دسترسی', 'guard_name' => 'web'],
            ['name' => 'ویرایش دسترسی', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات دسترسی', 'guard_name' => 'web'],
            ['name' => 'حذف دسترسی', 'guard_name' => 'web'],

            ['name' => 'لیست ساختمان', 'guard_name' => 'web'],
            ['name' => 'ایجاد ساختمان', 'guard_name' => 'web'],
            ['name' => 'ویرایش ساختمان', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات ساختمان', 'guard_name' => 'web'],
            ['name' => 'حذف ساختمان', 'guard_name' => 'web'],

            ['name' => 'لیست برند', 'guard_name' => 'web'],
            ['name' => 'ایجاد برند', 'guard_name' => 'web'],
            ['name' => 'ویرایش برند', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات برند', 'guard_name' => 'web'],
            ['name' => 'حذف برند', 'guard_name' => 'web'],

            ['name' => 'لیست مانیتور', 'guard_name' => 'web'],
            ['name' => 'ایجاد مانیتور', 'guard_name' => 'web'],
            ['name' => 'ویرایش مانیتور', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات مانیتور', 'guard_name' => 'web'],
            ['name' => 'حذف مانیتور', 'guard_name' => 'web'],

            ['name' => 'لیست کیس', 'guard_name' => 'web'],
            ['name' => 'ایجاد کیس', 'guard_name' => 'web'],
            ['name' => 'ویرایش کیس', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات کیس', 'guard_name' => 'web'],
            ['name' => 'حذف کیس', 'guard_name' => 'web'],

            ['name' => 'لیست پردازنده', 'guard_name' => 'web'],
            ['name' => 'ایجاد پردازنده', 'guard_name' => 'web'],
            ['name' => 'ویرایش پردازنده', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات پردازنده', 'guard_name' => 'web'],
            ['name' => 'حذف پردازنده', 'guard_name' => 'web'],

            ['name' => 'لیست مادربورد', 'guard_name' => 'web'],
            ['name' => 'ایجاد مادربورد', 'guard_name' => 'web'],
            ['name' => 'ویرایش مادربورد', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات مادربورد', 'guard_name' => 'web'],
            ['name' => 'حذف مادربورد', 'guard_name' => 'web'],

            ['name' => 'لیست منبع تغذیه', 'guard_name' => 'web'],
            ['name' => 'ایجاد منبع تغذیه', 'guard_name' => 'web'],
            ['name' => 'ویرایش منبع تغذیه', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات منبع تغذیه', 'guard_name' => 'web'],
            ['name' => 'حذف منبع تغذیه', 'guard_name' => 'web'],

            ['name' => 'لیست رم', 'guard_name' => 'web'],
            ['name' => 'ایجاد رم', 'guard_name' => 'web'],
            ['name' => 'ویرایش رم', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات رم', 'guard_name' => 'web'],
            ['name' => 'حذف رم', 'guard_name' => 'web'],

            ['name' => 'لیست کارت گرافیک', 'guard_name' => 'web'],
            ['name' => 'ایجاد کارت گرافیک', 'guard_name' => 'web'],
            ['name' => 'ویرایش کارت گرافیک', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات کارت گرافیک', 'guard_name' => 'web'],
            ['name' => 'حذف کارت گرافیک', 'guard_name' => 'web'],

            ['name' => 'لیست هارد اینترنال', 'guard_name' => 'web'],
            ['name' => 'ایجاد هارد اینترنال', 'guard_name' => 'web'],
            ['name' => 'ویرایش هارد اینترنال', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات هارد اینترنال', 'guard_name' => 'web'],
            ['name' => 'حذف هارد اینترنال', 'guard_name' => 'web'],

            ['name' => 'لیست درایو نوری', 'guard_name' => 'web'],
            ['name' => 'ایجاد درایو نوری', 'guard_name' => 'web'],
            ['name' => 'ویرایش درایو نوری', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات درایو نوری', 'guard_name' => 'web'],
            ['name' => 'حذف درایو نوری', 'guard_name' => 'web'],

            ['name' => 'لیست موس', 'guard_name' => 'web'],
            ['name' => 'ایجاد موس', 'guard_name' => 'web'],
            ['name' => 'ویرایش موس', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات موس', 'guard_name' => 'web'],
            ['name' => 'حذف موس', 'guard_name' => 'web'],

            ['name' => 'لیست صفحه کلید', 'guard_name' => 'web'],
            ['name' => 'ایجاد صفحه کلید', 'guard_name' => 'web'],
            ['name' => 'ویرایش صفحه کلید', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات صفحه کلید', 'guard_name' => 'web'],
            ['name' => 'حذف صفحه کلید', 'guard_name' => 'web'],

            ['name' => 'لیست هدست', 'guard_name' => 'web'],
            ['name' => 'ایجاد هدست', 'guard_name' => 'web'],
            ['name' => 'ویرایش هدست', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات هدست', 'guard_name' => 'web'],
            ['name' => 'حذف هدست', 'guard_name' => 'web'],

            ['name' => 'لیست کارت شبکه', 'guard_name' => 'web'],
            ['name' => 'ایجاد کارت شبکه', 'guard_name' => 'web'],
            ['name' => 'ویرایش کارت شبکه', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات کارت شبکه', 'guard_name' => 'web'],
            ['name' => 'حذف کارت شبکه', 'guard_name' => 'web'],

            ['name' => 'لیست پرینتر', 'guard_name' => 'web'],
            ['name' => 'ایجاد پرینتر', 'guard_name' => 'web'],
            ['name' => 'ویرایش پرینتر', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات پرینتر', 'guard_name' => 'web'],
            ['name' => 'حذف پرینتر', 'guard_name' => 'web'],

            ['name' => 'لیست اسکنر', 'guard_name' => 'web'],
            ['name' => 'ایجاد اسکنر', 'guard_name' => 'web'],
            ['name' => 'ویرایش اسکنر', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات اسکنر', 'guard_name' => 'web'],
            ['name' => 'حذف اسکنر', 'guard_name' => 'web'],

            ['name' => 'لیست دستگاه کپی', 'guard_name' => 'web'],
            ['name' => 'ایجاد دستگاه کپی', 'guard_name' => 'web'],
            ['name' => 'ویرایش دستگاه کپی', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات دستگاه کپی', 'guard_name' => 'web'],
            ['name' => 'حذف دستگاه کپی', 'guard_name' => 'web'],

            ['name' => 'لیست VOIP', 'guard_name' => 'web'],
            ['name' => 'ایجاد VOIP', 'guard_name' => 'web'],
            ['name' => 'ویرایش VOIP', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات VOIP', 'guard_name' => 'web'],
            ['name' => 'حذف VOIP', 'guard_name' => 'web'],

            ['name' => 'لیست مودم', 'guard_name' => 'web'],
            ['name' => 'ایجاد مودم', 'guard_name' => 'web'],
            ['name' => 'ویرایش مودم', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات مودم', 'guard_name' => 'web'],
            ['name' => 'حذف مودم', 'guard_name' => 'web'],

            ['name' => 'لیست سوییچ', 'guard_name' => 'web'],
            ['name' => 'ایجاد سوییچ', 'guard_name' => 'web'],
            ['name' => 'ویرایش سوییچ', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات سوییچ', 'guard_name' => 'web'],
            ['name' => 'حذف سوییچ', 'guard_name' => 'web'],

            ['name' => 'لیست رک', 'guard_name' => 'web'],
            ['name' => 'ایجاد رک', 'guard_name' => 'web'],
            ['name' => 'ویرایش رک', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات رک', 'guard_name' => 'web'],
            ['name' => 'حذف رک', 'guard_name' => 'web'],

            ['name' => 'لیست دانگل', 'guard_name' => 'web'],
            ['name' => 'ایجاد دانگل', 'guard_name' => 'web'],
            ['name' => 'ویرایش دانگل', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات دانگل', 'guard_name' => 'web'],
            ['name' => 'حذف دانگل', 'guard_name' => 'web'],

            ['name' => 'لیست هارد اکسترنال', 'guard_name' => 'web'],
            ['name' => 'ایجاد هارد اکسترنال', 'guard_name' => 'web'],
            ['name' => 'ویرایش هارد اکسترنال', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات هارد اکسترنال', 'guard_name' => 'web'],
            ['name' => 'حذف هارد اکسترنال', 'guard_name' => 'web'],

            ['name' => 'لیست تلفن رومیزی', 'guard_name' => 'web'],
            ['name' => 'ایجاد تلفن رومیزی', 'guard_name' => 'web'],
            ['name' => 'ویرایش تلفن رومیزی', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات تلفن رومیزی', 'guard_name' => 'web'],
            ['name' => 'حذف تلفن رومیزی', 'guard_name' => 'web'],

            ['name' => 'لیست تلوزیون', 'guard_name' => 'web'],
            ['name' => 'ایجاد تلوزیون', 'guard_name' => 'web'],
            ['name' => 'ویرایش تلوزیون', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات تلوزیون', 'guard_name' => 'web'],
            ['name' => 'حذف تلوزیون', 'guard_name' => 'web'],

            ['name' => 'لیست تلفن همراه', 'guard_name' => 'web'],
            ['name' => 'ایجاد تلفن همراه', 'guard_name' => 'web'],
            ['name' => 'ویرایش تلفن همراه', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات تلفن همراه', 'guard_name' => 'web'],
            ['name' => 'حذف تلفن همراه', 'guard_name' => 'web'],

            ['name' => 'لیست تبلت', 'guard_name' => 'web'],
            ['name' => 'ایجاد تبلت', 'guard_name' => 'web'],
            ['name' => 'ویرایش تبلت', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات تبلت', 'guard_name' => 'web'],
            ['name' => 'حذف تبلت', 'guard_name' => 'web'],

            ['name' => 'لیست کارت DVB', 'guard_name' => 'web'],
            ['name' => 'ایجاد کارت DVB', 'guard_name' => 'web'],
            ['name' => 'ویرایش کارت DVB', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات کارت DVB', 'guard_name' => 'web'],
            ['name' => 'حذف کارت DVB', 'guard_name' => 'web'],

            ['name' => 'لیست پایه دوربین', 'guard_name' => 'web'],
            ['name' => 'ایجاد پایه دوربین', 'guard_name' => 'web'],
            ['name' => 'ویرایش پایه دوربین', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات پایه دوربین', 'guard_name' => 'web'],
            ['name' => 'حذف پایه دوربین', 'guard_name' => 'web'],

            ['name' => 'لیست سیمکارت', 'guard_name' => 'web'],
            ['name' => 'ایجاد سیمکارت', 'guard_name' => 'web'],
            ['name' => 'ویرایش سیمکارت', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات سیمکارت', 'guard_name' => 'web'],
            ['name' => 'حذف سیمکارت', 'guard_name' => 'web'],

            ['name' => 'لیست آچار پانچ', 'guard_name' => 'web'],
            ['name' => 'ایجاد آچار پانچ', 'guard_name' => 'web'],
            ['name' => 'ویرایش آچار پانچ', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات آچار پانچ', 'guard_name' => 'web'],
            ['name' => 'حذف آچار پانچ', 'guard_name' => 'web'],

            ['name' => 'لیست آچار سوکت', 'guard_name' => 'web'],
            ['name' => 'ایجاد آچار سوکت', 'guard_name' => 'web'],
            ['name' => 'ویرایش آچار سوکت', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات آچار سوکت', 'guard_name' => 'web'],
            ['name' => 'حذف آچار سوکت', 'guard_name' => 'web'],

            ['name' => 'لیست آچار استریپر', 'guard_name' => 'web'],
            ['name' => 'ایجاد آچار استریپر', 'guard_name' => 'web'],
            ['name' => 'ویرایش آچار استریپر', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات آچار استریپر', 'guard_name' => 'web'],
            ['name' => 'حذف آچار استریپر', 'guard_name' => 'web'],

            ['name' => 'لیست تستر شبکه', 'guard_name' => 'web'],
            ['name' => 'ایجاد تستر شبکه', 'guard_name' => 'web'],
            ['name' => 'ویرایش تستر شبکه', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات تستر شبکه', 'guard_name' => 'web'],
            ['name' => 'حذف تستر شبکه', 'guard_name' => 'web'],

            ['name' => 'لیست kvm', 'guard_name' => 'web'],
            ['name' => 'ایجاد kvm', 'guard_name' => 'web'],
            ['name' => 'ویرایش kvm', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات kvm', 'guard_name' => 'web'],
            ['name' => 'حذف kvm', 'guard_name' => 'web'],

            ['name' => 'لیست lantv', 'guard_name' => 'web'],
            ['name' => 'ایجاد lantv', 'guard_name' => 'web'],
            ['name' => 'ویرایش lantv', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات lantv', 'guard_name' => 'web'],
            ['name' => 'حذف lantv', 'guard_name' => 'web'],

            ['name' => 'لیست اسپیکر', 'guard_name' => 'web'],
            ['name' => 'ایجاد اسپیکر', 'guard_name' => 'web'],
            ['name' => 'ویرایش اسپیکر', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات اسپیکر', 'guard_name' => 'web'],
            ['name' => 'حذف اسپیکر', 'guard_name' => 'web'],

            ['name' => 'لیست دستگاه حضور و غیاب', 'guard_name' => 'web'],
            ['name' => 'ایجاد دستگاه حضور و غیاب', 'guard_name' => 'web'],
            ['name' => 'ویرایش دستگاه حضور و غیاب', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات دستگاه حضور و غیاب', 'guard_name' => 'web'],
            ['name' => 'حذف دستگاه حضور و غیاب', 'guard_name' => 'web'],

            ['name' => 'لیست دوربین مدار بسته', 'guard_name' => 'web'],
            ['name' => 'ایجاد دوربین مدار بسته', 'guard_name' => 'web'],
            ['name' => 'ویرایش دوربین مدار بسته', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات دوربین مدار بسته', 'guard_name' => 'web'],
            ['name' => 'حذف دوربین مدار بسته', 'guard_name' => 'web'],

            ['name' => 'لیست رکوردر', 'guard_name' => 'web'],
            ['name' => 'ایجاد رکوردر', 'guard_name' => 'web'],
            ['name' => 'ویرایش رکوردر', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات رکوردر', 'guard_name' => 'web'],
            ['name' => 'حذف رکوردر', 'guard_name' => 'web'],

            ['name' => 'لیست وبکم', 'guard_name' => 'web'],
            ['name' => 'ایجاد وبکم', 'guard_name' => 'web'],
            ['name' => 'ویرایش وبکم', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات وبکم', 'guard_name' => 'web'],
            ['name' => 'حذف وبکم', 'guard_name' => 'web'],

            ['name' => 'لیست فلش مموری', 'guard_name' => 'web'],
            ['name' => 'ایجاد فلش مموری', 'guard_name' => 'web'],
            ['name' => 'ویرایش فلش مموری', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات فلش مموری', 'guard_name' => 'web'],
            ['name' => 'حذف فلش مموری', 'guard_name' => 'web'],

            ['name' => 'لیست ups', 'guard_name' => 'web'],
            ['name' => 'ایجاد ups', 'guard_name' => 'web'],
            ['name' => 'ویرایش ups', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات ups', 'guard_name' => 'web'],
            ['name' => 'حذف ups', 'guard_name' => 'web'],

            ['name' => 'لیست دیش ماهواره', 'guard_name' => 'web'],
            ['name' => 'ایجاد دیش ماهواره', 'guard_name' => 'web'],
            ['name' => 'ویرایش دیش ماهواره', 'guard_name' => 'web'],
            ['name' => 'نمایش جزئیات دیش ماهواره', 'guard_name' => 'web'],
            ['name' => 'حذف دیش ماهواره', 'guard_name' => 'web'],

            ['name' => 'لیست پرسنل', 'guard_name' => 'web'],
            ['name' => 'ایجاد پرسنل', 'guard_name' => 'web'],
            ['name' => 'ویرایش پرسنل', 'guard_name' => 'web'],
            ['name' => 'ویرایش تجهیزات پرسنل', 'guard_name' => 'web'],
            ['name' => 'انتقال تجهیزات پرسنل', 'guard_name' => 'web'],

            // Users Manager
            ['name' => 'لیست کاربران', 'guard_name' => 'web'],
            ['name' => 'ایجاد کاربر', 'guard_name' => 'web'],
            ['name' => 'ویرایش کاربر', 'guard_name' => 'web'],
            ['name' => 'تغییر وضعیت کاربر', 'guard_name' => 'web'],
            ['name' => 'تغییر وضعیت نیازمند به تغییر رمز عبور', 'guard_name' => 'web'],
            ['name' => 'بازنشانی رمز عبور کاربر', 'guard_name' => 'web'],
            ['name' => 'جستجوی کاربر', 'guard_name' => 'web'],

            // Database Backup
            ['name' => 'لیست بکاپ دیتابیس', 'guard_name' => 'web'],
            ['name' => 'ایجاد بکاپ دیتابیس', 'guard_name' => 'web'],

            ['name' => 'telescope', 'guard_name' => 'web']
        ];

        // Inserting the permissions into the database
        Permission::insert($permissions);

        $superAdminRole = Role::create(['name' => 'ادمین کل']);
        $superAdminRole->givePermissionTo([
            'telescope',
            'لیست مقادیر اولیه',
            'لیست تجهیزات پشتیبانی',
            'لیست تجهیزات سخت افزاری',
            'لیست تجهیزات دیجیتال',
            'لیست تجهیزات شبکه',

            'لیست نقش',
            'ایجاد نقش',
            'ویرایش نقش',
            'نمایش جزئیات نقش',
            'حذف نقش',

            'لیست دسترسی',
            'ایجاد دسترسی',
            'ویرایش دسترسی',
            'نمایش جزئیات دسترسی',
            'حذف دسترسی',

            'لیست ساختمان',
            'ایجاد ساختمان',
            'ویرایش ساختمان',
            'نمایش جزئیات ساختمان',
            'حذف ساختمان',

            'لیست برند',
            'ایجاد برند',
            'ویرایش برند',
            'نمایش جزئیات برند',
            'حذف برند',

            'لیست مانیتور',
            'ایجاد مانیتور',
            'ویرایش مانیتور',
            'نمایش جزئیات مانیتور',
            'حذف مانیتور',

            'لیست کیس',
            'ایجاد کیس',
            'ویرایش کیس',
            'نمایش جزئیات کیس',
            'حذف کیس',

            'لیست پردازنده',
            'ایجاد پردازنده',
            'ویرایش پردازنده',
            'نمایش جزئیات پردازنده',
            'حذف پردازنده',

            'لیست مادربورد',
            'ایجاد مادربورد',
            'ویرایش مادربورد',
            'نمایش جزئیات مادربورد',
            'حذف مادربورد',

            'لیست منبع تغذیه',
            'ایجاد منبع تغذیه',
            'ویرایش منبع تغذیه',
            'نمایش جزئیات منبع تغذیه',
            'حذف منبع تغذیه',

            'لیست رم',
            'ایجاد رم',
            'ویرایش رم',
            'نمایش جزئیات رم',
            'حذف رم',

            'لیست کارت گرافیک',
            'ایجاد کارت گرافیک',
            'ویرایش کارت گرافیک',
            'نمایش جزئیات کارت گرافیک',
            'حذف کارت گرافیک',

            'لیست هارد اینترنال',
            'ایجاد هارد اینترنال',
            'ویرایش هارد اینترنال',
            'نمایش جزئیات هارد اینترنال',
            'حذف هارد اینترنال',

            'لیست درایو نوری',
            'ایجاد درایو نوری',
            'ویرایش درایو نوری',
            'نمایش جزئیات درایو نوری',
            'حذف درایو نوری',

            'لیست موس',
            'ایجاد موس',
            'ویرایش موس',
            'نمایش جزئیات موس',
            'حذف موس',

            'لیست صفحه کلید',
            'ایجاد صفحه کلید',
            'ویرایش صفحه کلید',
            'نمایش جزئیات صفحه کلید',
            'حذف صفحه کلید',

            'لیست هدست',
            'ایجاد هدست',
            'ویرایش هدست',
            'نمایش جزئیات هدست',
            'حذف هدست',

            'لیست پرینتر',
            'ایجاد پرینتر',
            'ویرایش پرینتر',
            'نمایش جزئیات پرینتر',
            'حذف پرینتر',

            'لیست اسکنر',
            'ایجاد اسکنر',
            'ویرایش اسکنر',
            'نمایش جزئیات اسکنر',
            'حذف اسکنر',

            'لیست دستگاه کپی',
            'ایجاد دستگاه کپی',
            'ویرایش دستگاه کپی',
            'نمایش جزئیات دستگاه کپی',
            'حذف دستگاه کپی',

            'لیست VOIP',
            'ایجاد VOIP',
            'ویرایش VOIP',
            'نمایش جزئیات VOIP',
            'حذف VOIP',

            'لیست کارت شبکه',
            'ایجاد کارت شبکه',
            'ویرایش کارت شبکه',
            'نمایش جزئیات کارت شبکه',
            'حذف کارت شبکه',

            'لیست مودم',
            'ایجاد مودم',
            'ویرایش مودم',
            'نمایش جزئیات مودم',
            'حذف مودم',

            'لیست سوییچ',
            'ایجاد سوییچ',
            'ویرایش سوییچ',
            'نمایش جزئیات سوییچ',
            'حذف سوییچ',

            'لیست رک',
            'ایجاد رک',
            'ویرایش رک',
            'نمایش جزئیات رک',
            'حذف رک',

            'لیست دانگل',
            'ایجاد دانگل',
            'ویرایش دانگل',
            'نمایش جزئیات دانگل',
            'حذف دانگل',

            'لیست هارد اکسترنال',
            'ایجاد هارد اکسترنال',
            'ویرایش هارد اکسترنال',
            'نمایش جزئیات هارد اکسترنال',
            'حذف هارد اکسترنال',

            'لیست تلفن رومیزی',
            'ایجاد تلفن رومیزی',
            'ویرایش تلفن رومیزی',
            'نمایش جزئیات تلفن رومیزی',
            'حذف تلفن رومیزی',

            'لیست تلوزیون',
            'ایجاد تلوزیون',
            'ویرایش تلوزیون',
            'نمایش جزئیات تلوزیون',
            'حذف تلوزیون',

            'لیست تلفن همراه',
            'ایجاد تلفن همراه',
            'ویرایش تلفن همراه',
            'نمایش جزئیات تلفن همراه',
            'حذف تلفن همراه',

            'لیست تبلت',
            'ایجاد تبلت',
            'ویرایش تبلت',
            'نمایش جزئیات تبلت',
            'حذف تبلت',

            'لیست کارت DVB',
            'ایجاد کارت DVB',
            'ویرایش کارت DVB',
            'نمایش جزئیات کارت DVB',
            'حذف کارت DVB',

            'لیست پایه دوربین',
            'ایجاد پایه دوربین',
            'ویرایش پایه دوربین',
            'نمایش جزئیات پایه دوربین',
            'حذف پایه دوربین',

            'لیست سیمکارت',
            'ایجاد سیمکارت',
            'ویرایش سیمکارت',
            'نمایش جزئیات سیمکارت',
            'حذف سیمکارت',

            'لیست آچار پانچ',
            'ایجاد آچار پانچ',
            'ویرایش آچار پانچ',
            'نمایش جزئیات آچار پانچ',
            'حذف آچار پانچ',

            'لیست آچار سوکت',
            'ایجاد آچار سوکت',
            'ویرایش آچار سوکت',
            'نمایش جزئیات آچار سوکت',
            'حذف آچار سوکت',

            'لیست آچار استریپر',
            'ایجاد آچار استریپر',
            'ویرایش آچار استریپر',
            'نمایش جزئیات آچار استریپر',
            'حذف آچار استریپر',

            'لیست تستر شبکه',
            'ایجاد تستر شبکه',
            'ویرایش تستر شبکه',
            'نمایش جزئیات تستر شبکه',
            'حذف تستر شبکه',

            'لیست kvm',
            'ایجاد kvm',
            'ویرایش kvm',
            'نمایش جزئیات kvm',
            'حذف kvm',

            'لیست lantv',
            'ایجاد lantv',
            'ویرایش lantv',
            'نمایش جزئیات lantv',
            'حذف lantv',

            'لیست اسپیکر',
            'ایجاد اسپیکر',
            'ویرایش اسپیکر',
            'نمایش جزئیات اسپیکر',
            'حذف اسپیکر',

            'لیست دستگاه حضور و غیاب',
            'ایجاد دستگاه حضور و غیاب',
            'ویرایش دستگاه حضور و غیاب',
            'نمایش جزئیات دستگاه حضور و غیاب',
            'حذف دستگاه حضور و غیاب',

            'لیست دوربین مدار بسته',
            'ایجاد دوربین مدار بسته',
            'ویرایش دوربین مدار بسته',
            'نمایش جزئیات دوربین مدار بسته',
            'حذف دوربین مدار بسته',

            'لیست رکوردر',
            'ایجاد رکوردر',
            'ویرایش رکوردر',
            'نمایش جزئیات رکوردر',
            'حذف رکوردر',

            'لیست وبکم',
            'ایجاد وبکم',
            'ویرایش وبکم',
            'نمایش جزئیات وبکم',
            'حذف وبکم',

            'لیست فلش مموری',
            'ایجاد فلش مموری',
            'ویرایش فلش مموری',
            'نمایش جزئیات فلش مموری',
            'حذف فلش مموری',

            'لیست ups',
            'ایجاد ups',
            'ویرایش ups',
            'نمایش جزئیات ups',
            'حذف ups',

            'لیست دیش ماهواره',
            'ایجاد دیش ماهواره',
            'ویرایش دیش ماهواره',
            'نمایش جزئیات دیش ماهواره',
            'حذف دیش ماهواره',

            'لیست پرسنل',
            'ایجاد پرسنل',
            'ویرایش پرسنل',
            'ویرایش تجهیزات پرسنل',
            'انتقال تجهیزات پرسنل',

            'لیست کاربران',
            'ایجاد کاربر',
            'ویرایش کاربر',
            'تغییر وضعیت کاربر',
            'تغییر وضعیت نیازمند به تغییر رمز عبور',
            'بازنشانی رمز عبور کاربر',
            'جستجوی کاربر',
            'لیست بکاپ دیتابیس',
            'ایجاد بکاپ دیتابیس',
        ]);

        $role = Role::where('name', 'ادمین کل')->first();
        $users = User::get();
        foreach ($users as $user) {
            $user = User::findOrFail($user->id);
            $user->assignRole([$role->id]);
        }
    }
}
